-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Окт 19 2025 г., 23:12
-- Версия сервера: 8.0.43
-- Версия PHP: 8.2.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cas`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cards`
--

CREATE TABLE `cards` (
  `id` int NOT NULL COMMENT 'Идентификатор',
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Почта игрока',
  `card_numb` varchar(19) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Номер карточки',
  `card_date` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Дата на карте',
  `card_cvc` varchar(3) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'CVC код карты'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `cards`
--

INSERT INTO `cards` (`id`, `email`, `card_numb`, `card_date`, `card_cvc`) VALUES
(5, 'e@example.com', '1111 1111 1111 1111', '11/11', '111'),
(6, 'e@example.com', '1234 5612 3465 1230', '12/32', '023'),
(7, 'e@example.com', '1231 2312 3123 1231', '12/12', '121');

-- --------------------------------------------------------

--
-- Структура таблицы `inventory`
--

CREATE TABLE `inventory` (
  `id` int NOT NULL COMMENT 'идентификатор предмета 1 предмет одному игроку',
  `item_id` int NOT NULL COMMENT 'идентификатор предмета',
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'идентификатор пользователя'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `inventory`
--

INSERT INTO `inventory` (`id`, `item_id`, `email`) VALUES
(3, 3, 'e@example.com'),
(5, 5, 'e@example.com'),
(6, 6, 'e@example.com'),
(14, 14, 'e@example.com'),
(15, 18, 'e@example.com'),
(16, 5, 'e@example.com'),
(30, 9, 'e@example.com'),
(31, 12, 'e@example.com'),
(53, 3, 't@example.com'),
(54, 4, 't@example.com'),
(55, 15, 'e@example.com');

-- --------------------------------------------------------

--
-- Структура таблицы `items`
--

CREATE TABLE `items` (
  `item_id` int NOT NULL COMMENT 'Идентификатор предмета',
  `item_type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Тип предмета',
  `path` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Путь до картинки предмета',
  `description` varchar(250) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT 'Описание предмета',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Наименование предмета',
  `cost` int NOT NULL COMMENT 'Стоимость предмета'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `items`
--

INSERT INTO `items` (`item_id`, `item_type`, `path`, `description`, `name`, `cost`) VALUES
(3, 'Аватар', 'imgs/аватар 1М.png', 'Аватар начальный мужской', 'Аватар \"Обычный\"', 0),
(4, 'Аватар', 'imgs/аватар 1Ж.png', 'Аватар начальный женский', 'Аватар \"Обычный\"', 0),
(5, 'Аватар', 'imgs/аватар 2М.png', 'Аватар обычный мужской', 'Аватар придумать название', 10),
(6, 'Аватар', 'imgs/аватар 2Ж.png', 'Аватар обычный женский', 'Аватар придумать название', 10),
(9, 'Аватар', 'imgs/аватар 3.png', 'Аватар \"Хитрый Шулер\"', 'Аватар Шулер', 100),
(10, 'Аватар', 'imgs/аватар 4.png', 'Аватар \"Богатый лев\"', 'Аватар Лев', 250),
(11, 'Аватар', 'imgs/аватар 5.png', 'Аватар \"Гений БлэкДжэка\"', 'Аватар БлэкДжэк', 400),
(12, 'Аватар', 'imgs/аватар 6.png', 'Аватар \"Король БлэкДжэка\"', 'Аватар Богатый', 500),
(13, 'Аватар', 'imgs/аватар 7.png', 'Аватар \"Хитрый лис\"', 'Аватар Лис', 400),
(14, 'Аватар', 'imgs/аватар 8.png', 'Аватар \"Жена Мафиози\"', 'Аватар Богатая женщина', 750),
(15, 'Аватар', 'imgs/аватар 9.png', 'Аватар \"Дед лудоман\"', 'Аватар Дедуля', 200),
(16, 'Аватар', 'imgs/аватар 10.png', 'Аватар \"Киборг покера\"', 'Аватар Робот', 1000),
(17, 'Аватар', 'imgs/аватар 11.png', 'Аватар \"Карточный книгер\"', 'Аватар Волшебный лудоман', 1500),
(18, 'Аватар', 'imgs/аватар 12.png', 'Аватар \"Заводной песик\"', 'Аватар Пес Лудоман', 1500),
(19, 'Аватар', 'imgs/68f56f21cb4c4_.png', 'Хочешь быть таким же богатым как и он? Достойное желание', 'Аватар богатый дядя', 2500),
(20, 'Аватар', 'imgs/68f56f6bb4d8f_2.png', 'Кажется она тебе нагадает удачу...', 'Аватар женщина картежница', 3000),
(21, 'Аватар', 'imgs/68f56f93022f5_3.png', 'Защитит твой кошелек от проигрыша', 'Аватар темнокожый защитник', 3500),
(22, 'Аватар', 'imgs/68f56fdfa1e97_4.png', 'Лев миллионер - приносит не только удачу, но и деньги', 'Аватар Лев Миллионер', 4000),
(23, 'Аватар', 'imgs/68f5700c23126_5.png', 'Если быть таким же ласковым как кот, то и богатым таким же будешь', 'Аватар Котик', 50000);

-- --------------------------------------------------------

--
-- Структура таблицы `item_type`
--

CREATE TABLE `item_type` (
  `item_type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `item_type`
--

INSERT INTO `item_type` (`item_type`) VALUES
('Аватар'),
('Предмет');

-- --------------------------------------------------------

--
-- Структура таблицы `op_types`
--

CREATE TABLE `op_types` (
  `op_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Тип операции'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `op_types`
--

INSERT INTO `op_types` (`op_type`) VALUES
('Вывод'),
('Выигрыш'),
('Покупка'),
('Пополнение'),
('Продажа'),
('Проигрыш'),
('Регистрация');

-- --------------------------------------------------------

--
-- Структура таблицы `statuses`
--

CREATE TABLE `statuses` (
  `status_name` varchar(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Статус игрока'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `statuses`
--

INSERT INTO `statuses` (`status_name`) VALUES
('premium'),
('VIP'),
('Админ'),
('Обычный');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Почта/логин',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Пароль',
  `surname` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Фамилия',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Имя',
  `lastname` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT 'Отчество',
  `balance` int NOT NULL COMMENT 'Баланс',
  `status` varchar(25) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ava` int NOT NULL COMMENT 'аватарка',
  `regdate` date DEFAULT NULL COMMENT 'Дата регистрации'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`email`, `password`, `surname`, `name`, `lastname`, `balance`, `status`, `ava`, `regdate`) VALUES
('e@example.com', '$2y$10$tE7/Bu/qbbxyLFbnsdRwUupRp0qURJC25szkbU9swXjdjkjmIlRZm', 'Админов', 'Админ', 'Палыч', 100000304, 'Админ', 15, '2025-08-02'),
('t@example.com', '$2y$10$/wES1LFM8McfvCrQBwYoOOwtM0ieRgoDptp8d7u2JRxHfhUeYRLje', 'Шиляев', 'Сергей', 'Павлович', 0, 'Обычный', 3, '2025-10-14');

-- --------------------------------------------------------

--
-- Структура таблицы `user_game_story`
--

CREATE TABLE `user_game_story` (
  `op_id` int NOT NULL COMMENT 'Идентификатор операции',
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'email пользователя',
  `op_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'Тип операции',
  `balance` int NOT NULL COMMENT 'Новый баланс после игры',
  `changebalance` int NOT NULL COMMENT 'Изменение баланса',
  `time` time NOT NULL COMMENT 'Время изменения баланса',
  `date` date NOT NULL COMMENT 'Дата операции'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `user_game_story`
--

INSERT INTO `user_game_story` (`op_id`, `email`, `op_type`, `balance`, `changebalance`, `time`, `date`) VALUES
(21, 'e@example.com', 'Проигрыш', 999967519, -50000, '04:15:07', '2025-10-14'),
(22, 'e@example.com', 'Проигрыш', 999917519, -50000, '04:15:11', '2025-10-14'),
(24, 'e@example.com', 'Покупка', 999916919, -500, '04:20:23', '2025-10-14'),
(25, 'e@example.com', 'Проигрыш', 999916919, 0, '05:11:06', '2025-10-14'),
(26, 'e@example.com', 'Проигрыш', 999916919, 0, '05:11:45', '2025-10-14'),
(27, 'e@example.com', 'Выигрыш', 999916929, 10, '05:13:28', '2025-10-14'),
(28, 'e@example.com', 'Выигрыш', 999917929, 1000, '05:14:35', '2025-10-14'),
(29, 'e@example.com', 'Проигрыш', 999916929, -1000, '05:15:48', '2025-10-14'),
(30, 'e@example.com', 'Проигрыш', 999915929, -1000, '05:15:53', '2025-10-14'),
(31, 'e@example.com', 'Проигрыш', 999914929, -1000, '05:15:57', '2025-10-14'),
(32, 'e@example.com', 'Проигрыш', 999913929, -1000, '05:16:01', '2025-10-14'),
(33, 'e@example.com', 'Проигрыш', 999912929, -1000, '05:16:05', '2025-10-14'),
(34, 'e@example.com', 'Проигрыш', 999911929, -1000, '05:16:09', '2025-10-14'),
(35, 'e@example.com', 'Проигрыш', 999910929, -1000, '05:16:13', '2025-10-14'),
(36, 'e@example.com', 'Выигрыш', 999913929, 3000, '05:16:17', '2025-10-14'),
(37, 'e@example.com', 'Выигрыш', 999913954, 25, '05:19:40', '2025-10-14'),
(38, 'e@example.com', 'Проигрыш', 999913944, -10, '05:19:54', '2025-10-14'),
(39, 'e@example.com', 'Проигрыш', 999913934, -10, '05:19:59', '2025-10-14'),
(40, 'e@example.com', 'Выигрыш', 999913944, 10, '05:20:03', '2025-10-14'),
(41, 'e@example.com', 'Проигрыш', 999912944, -1000, '05:20:11', '2025-10-14'),
(42, 'e@example.com', 'Выигрыш', 999913944, 1000, '05:20:15', '2025-10-14'),
(43, 'e@example.com', 'Проигрыш', 999913934, -10, '05:22:45', '2025-10-14'),
(44, 'e@example.com', 'Проигрыш', 999913924, -10, '05:22:53', '2025-10-14'),
(45, 'e@example.com', 'Выигрыш', 999913944, 20, '05:28:11', '2025-10-14'),
(46, 'e@example.com', 'Выигрыш', 999913954, 10, '05:28:56', '2025-10-14'),
(47, 'e@example.com', 'Проигрыш', 999913944, -10, '05:32:39', '2025-10-14'),
(48, 'e@example.com', 'Проигрыш', 999913934, -10, '05:33:28', '2025-10-14'),
(49, 'e@example.com', 'Проигрыш', 999913924, -10, '05:35:29', '2025-10-14'),
(50, 'e@example.com', 'Выигрыш', 999913944, 20, '05:35:52', '2025-10-14'),
(51, 'e@example.com', 'Выигрыш', 999913964, 20, '05:38:08', '2025-10-14'),
(52, 'e@example.com', 'Проигрыш', 999913954, -10, '05:41:05', '2025-10-14'),
(53, 'e@example.com', 'Проигрыш', 999913944, -10, '05:43:29', '2025-10-14'),
(54, 'e@example.com', 'Выигрыш', 999913994, 50, '05:43:46', '2025-10-14'),
(55, 'e@example.com', 'Выигрыш', 999914004, 10, '05:58:37', '2025-10-14'),
(56, 'e@example.com', 'Выигрыш', 999914014, 10, '05:58:45', '2025-10-14'),
(57, 'e@example.com', 'Проигрыш', 999914004, -10, '05:58:55', '2025-10-14'),
(58, 'e@example.com', 'Выигрыш', 999914019, 15, '05:59:44', '2025-10-14'),
(59, 'e@example.com', 'Покупка', 999913519, -500, '06:00:09', '2025-10-14'),
(60, 'e@example.com', 'Выигрыш', 999913544, 25, '06:00:49', '2025-10-14'),
(61, 'e@example.com', 'Проигрыш', 999813544, -100000, '06:01:02', '2025-10-14'),
(62, 'e@example.com', 'Проигрыш', 999713544, -100000, '06:01:13', '2025-10-14'),
(63, 'e@example.com', 'Проигрыш', 999613544, -100000, '06:01:21', '2025-10-14'),
(64, 'e@example.com', 'Проигрыш', 999513544, -100000, '06:01:29', '2025-10-14'),
(65, 'e@example.com', 'Выигрыш', 999613544, 100000, '06:01:49', '2025-10-14'),
(66, 'e@example.com', 'Выигрыш', 999713544, 100000, '06:01:56', '2025-10-14'),
(67, 'e@example.com', 'Проигрыш', 999613544, -100000, '06:02:04', '2025-10-14'),
(68, 'e@example.com', 'Проигрыш', 999513544, -100000, '06:02:12', '2025-10-14'),
(69, 'e@example.com', 'Проигрыш', 999413544, -100000, '06:02:20', '2025-10-14'),
(70, 'e@example.com', 'Проигрыш', 999313544, -100000, '06:02:26', '2025-10-14'),
(71, 'e@example.com', 'Проигрыш', 989313544, -10000000, '06:02:35', '2025-10-14'),
(72, 'e@example.com', 'Проигрыш', 889313544, -100000000, '06:02:45', '2025-10-14'),
(73, 'e@example.com', 'Выигрыш', 1778627088, 889313544, '06:03:22', '2025-10-14'),
(128, 't@example.com', 'Регистрация', 1000, 1000, '07:58:11', '2025-10-14'),
(129, 't@example.com', 'Проигрыш', 990, -10, '08:05:46', '2025-10-14'),
(130, 't@example.com', 'Выигрыш', 1000, 10, '08:05:54', '2025-10-14'),
(131, 't@example.com', 'Выигрыш', 1010, 10, '08:10:27', '2025-10-14'),
(132, 't@example.com', 'Проигрыш', 1000, -10, '08:10:32', '2025-10-14'),
(133, 't@example.com', 'Выигрыш', 1020, 20, '08:10:38', '2025-10-14'),
(134, 't@example.com', 'Проигрыш', 1010, -10, '08:10:44', '2025-10-14'),
(135, 't@example.com', 'Проигрыш', 990, -20, '08:10:49', '2025-10-14'),
(136, 't@example.com', 'Выигрыш', 1030, 40, '08:10:55', '2025-10-14'),
(137, 't@example.com', 'Проигрыш', 1020, -10, '08:11:01', '2025-10-14'),
(138, 't@example.com', 'Выигрыш', 1040, 20, '08:11:07', '2025-10-14'),
(139, 't@example.com', 'Выигрыш', 1050, 10, '08:11:12', '2025-10-14'),
(140, 't@example.com', 'Выигрыш', 1060, 10, '08:11:18', '2025-10-14'),
(141, 't@example.com', 'Проигрыш', 1050, -10, '08:11:22', '2025-10-14'),
(142, 't@example.com', 'Проигрыш', 1030, -20, '08:11:28', '2025-10-14'),
(143, 't@example.com', 'Выигрыш', 1070, 40, '08:11:34', '2025-10-14'),
(144, 't@example.com', 'Проигрыш', 1060, -10, '08:13:39', '2025-10-14'),
(145, 't@example.com', 'Выигрыш', 1070, 10, '08:13:44', '2025-10-14'),
(146, 't@example.com', 'Проигрыш', 1060, -10, '08:13:49', '2025-10-14'),
(147, 't@example.com', 'Выигрыш', 1080, 20, '08:13:59', '2025-10-14'),
(148, 't@example.com', 'Выигрыш', 1090, 10, '08:14:09', '2025-10-14'),
(149, 't@example.com', 'Выигрыш', 1100, 10, '08:14:14', '2025-10-14'),
(150, 't@example.com', 'Выигрыш', 1110, 10, '08:14:19', '2025-10-14'),
(151, 't@example.com', 'Выигрыш', 1120, 10, '08:14:23', '2025-10-14'),
(152, 't@example.com', 'Выигрыш', 1130, 10, '08:14:28', '2025-10-14'),
(153, 't@example.com', 'Проигрыш', 1110, -20, '08:20:01', '2025-10-14'),
(154, 't@example.com', 'Выигрыш', 1150, 40, '08:20:07', '2025-10-14'),
(155, 't@example.com', 'Выигрыш', 1170, 20, '08:20:15', '2025-10-14'),
(156, 't@example.com', 'Проигрыш', 1150, -20, '08:20:27', '2025-10-14'),
(157, 't@example.com', 'Проигрыш', 1110, -40, '08:20:33', '2025-10-14'),
(158, 't@example.com', 'Выигрыш', 1190, 80, '08:20:38', '2025-10-14'),
(159, 't@example.com', 'Проигрыш', 1170, -20, '08:20:44', '2025-10-14'),
(160, 't@example.com', 'Проигрыш', 1130, -40, '08:20:49', '2025-10-14'),
(161, 't@example.com', 'Проигрыш', 1050, -80, '08:20:57', '2025-10-14'),
(162, 't@example.com', 'Проигрыш', 890, -160, '08:21:02', '2025-10-14'),
(163, 't@example.com', 'Выигрыш', 1210, 320, '08:21:08', '2025-10-14'),
(164, 't@example.com', 'Проигрыш', 1190, -20, '08:21:15', '2025-10-14'),
(165, 't@example.com', 'Выигрыш', 1230, 40, '08:21:21', '2025-10-14'),
(166, 't@example.com', 'Выигрыш', 1250, 20, '08:21:29', '2025-10-14'),
(167, 't@example.com', 'Проигрыш', 1230, -20, '08:21:37', '2025-10-14'),
(168, 't@example.com', 'Проигрыш', 1190, -40, '08:21:44', '2025-10-14'),
(169, 't@example.com', 'Выигрыш', 1270, 80, '08:21:51', '2025-10-14'),
(170, 't@example.com', 'Выигрыш', 1290, 20, '08:21:57', '2025-10-14'),
(171, 't@example.com', 'Проигрыш', 1270, -20, '08:22:02', '2025-10-14'),
(172, 't@example.com', 'Выигрыш', 1310, 40, '08:22:08', '2025-10-14'),
(173, 't@example.com', 'Выигрыш', 1350, 40, '08:22:15', '2025-10-14'),
(174, 't@example.com', 'Проигрыш', 1310, -40, '08:22:20', '2025-10-14'),
(175, 't@example.com', 'Проигрыш', 1230, -80, '08:22:25', '2025-10-14'),
(176, 't@example.com', 'Проигрыш', 1070, -160, '08:22:31', '2025-10-14'),
(177, 't@example.com', 'Выигрыш', 1390, 320, '08:22:36', '2025-10-14'),
(178, 't@example.com', 'Выигрыш', 1430, 40, '08:22:46', '2025-10-14'),
(179, 't@example.com', 'Выигрыш', 1470, 40, '08:22:50', '2025-10-14'),
(180, 't@example.com', 'Выигрыш', 1510, 40, '08:22:55', '2025-10-14'),
(181, 't@example.com', 'Выигрыш', 1550, 40, '08:23:00', '2025-10-14'),
(182, 't@example.com', 'Проигрыш', 1510, -40, '08:23:04', '2025-10-14'),
(183, 't@example.com', 'Проигрыш', 1430, -80, '08:23:10', '2025-10-14'),
(184, 't@example.com', 'Проигрыш', 1270, -160, '08:23:15', '2025-10-14'),
(185, 't@example.com', 'Проигрыш', 950, -320, '08:23:21', '2025-10-14'),
(186, 't@example.com', 'Проигрыш', 310, -640, '08:23:27', '2025-10-14'),
(187, 't@example.com', 'Проигрыш', 0, -310, '08:23:56', '2025-10-14'),
(188, 't@example.com', 'Проигрыш', 0, 0, '08:30:30', '2025-10-14'),
(192, 'e@example.com', 'Проигрыш', 1778627048, -10, '11:59:03', '2025-10-18'),
(193, 'e@example.com', 'Проигрыш', 1778627038, -10, '11:59:26', '2025-10-18'),
(194, 'e@example.com', 'Проигрыш', 1778627028, -10, '11:59:30', '2025-10-18'),
(195, 'e@example.com', 'Проигрыш', 1778627018, -10, '11:59:32', '2025-10-18'),
(196, 'e@example.com', 'Проигрыш', 1778627008, -10, '11:59:34', '2025-10-18'),
(197, 'e@example.com', 'Выигрыш', 1778627033, 25, '11:59:40', '2025-10-18'),
(198, 'e@example.com', 'Пополнение', 1778627133, 100, '12:49:41', '2025-10-18'),
(199, 'e@example.com', 'Пополнение', 1778627233, 100, '12:49:51', '2025-10-18'),
(200, 'e@example.com', 'Пополнение', 1778627333, 100, '12:50:23', '2025-10-18'),
(201, 'e@example.com', 'Пополнение', 1778627433, 100, '12:51:09', '2025-10-18'),
(202, 'e@example.com', 'Проигрыш', 1778627423, -10, '10:59:06', '2025-10-19'),
(203, 'e@example.com', 'Проигрыш', 1778627413, -10, '10:59:09', '2025-10-19'),
(204, 'e@example.com', 'Выигрыш', 1778627426, 13, '10:59:13', '2025-10-19'),
(205, 'e@example.com', 'Пополнение', 1778630226, 2800, '10:59:37', '2025-10-19'),
(206, 'e@example.com', 'Пополнение', 1778630826, 600, '11:00:35', '2025-10-19'),
(207, 'e@example.com', 'Выигрыш', 1778630861, 35, '13:34:10', '2025-10-19'),
(208, 'e@example.com', 'Проигрыш', 1778630851, -10, '13:34:12', '2025-10-19'),
(209, 'e@example.com', 'Проигрыш', 1778630841, -10, '13:34:15', '2025-10-19'),
(210, 'e@example.com', 'Проигрыш', 1778630831, -10, '13:34:17', '2025-10-19'),
(211, 'e@example.com', 'Проигрыш', 1778630821, -10, '13:34:19', '2025-10-19'),
(212, 'e@example.com', 'Проигрыш', 1778630811, -10, '13:34:21', '2025-10-19'),
(213, 'e@example.com', 'Проигрыш', 1778630801, -10, '13:34:23', '2025-10-19'),
(214, 'e@example.com', 'Проигрыш', 1778630791, -10, '13:34:36', '2025-10-19'),
(215, 'e@example.com', 'Проигрыш', 1778630781, -10, '13:34:38', '2025-10-19'),
(216, 'e@example.com', 'Проигрыш', 1778630771, -10, '13:34:40', '2025-10-19'),
(217, 'e@example.com', 'Проигрыш', 1778630761, -10, '13:35:26', '2025-10-19'),
(218, 'e@example.com', 'Проигрыш', 1778630751, -10, '13:35:27', '2025-10-19'),
(219, 'e@example.com', 'Проигрыш', 1778630741, -10, '13:35:29', '2025-10-19'),
(220, 'e@example.com', 'Выигрыш', 1778630776, 35, '13:35:33', '2025-10-19'),
(221, 'e@example.com', 'Выигрыш', 1778630811, 35, '13:35:45', '2025-10-19'),
(222, 'e@example.com', 'Проигрыш', 1778630801, -10, '13:35:48', '2025-10-19'),
(223, 'e@example.com', 'Проигрыш', 1778630791, -10, '13:35:50', '2025-10-19'),
(224, 'e@example.com', 'Проигрыш', 1778630781, -10, '13:35:52', '2025-10-19'),
(225, 'e@example.com', 'Выигрыш', 1778630816, 35, '13:35:56', '2025-10-19'),
(226, 'e@example.com', 'Проигрыш', 1778630806, -10, '13:36:05', '2025-10-19'),
(227, 'e@example.com', 'Проигрыш', 1778630796, -10, '13:38:16', '2025-10-19'),
(228, 'e@example.com', 'Проигрыш', 1778630786, -10, '13:38:19', '2025-10-19'),
(229, 'e@example.com', 'Проигрыш', 1778630776, -10, '13:38:27', '2025-10-19'),
(230, 'e@example.com', 'Проигрыш', 1778630766, -10, '13:38:29', '2025-10-19'),
(231, 'e@example.com', 'Проигрыш', 1778630756, -10, '13:38:30', '2025-10-19'),
(232, 'e@example.com', 'Проигрыш', 1778630746, -10, '13:38:34', '2025-10-19'),
(233, 'e@example.com', 'Проигрыш', 1778630736, -10, '13:38:36', '2025-10-19'),
(234, 'e@example.com', 'Проигрыш', 1778630726, -10, '13:38:39', '2025-10-19'),
(235, 'e@example.com', 'Проигрыш', 1778630716, -10, '13:38:42', '2025-10-19'),
(236, 'e@example.com', 'Проигрыш', 1778630706, -10, '13:38:47', '2025-10-19'),
(237, 'e@example.com', 'Проигрыш', 1778630696, -10, '13:38:50', '2025-10-19'),
(238, 'e@example.com', 'Проигрыш', 1778630686, -10, '13:38:52', '2025-10-19'),
(239, 'e@example.com', 'Проигрыш', 1778630676, -10, '13:38:55', '2025-10-19'),
(240, 'e@example.com', 'Выигрыш', 1778630756, 80, '13:39:08', '2025-10-19'),
(241, 'e@example.com', 'Выигрыш', 1778630836, 80, '13:39:16', '2025-10-19'),
(242, 'e@example.com', 'Выигрыш', 1778630916, 80, '13:39:23', '2025-10-19'),
(243, 'e@example.com', 'Выигрыш', 1778630996, 80, '13:39:28', '2025-10-19'),
(244, 'e@example.com', 'Проигрыш', 1778630916, -80, '13:39:34', '2025-10-19'),
(245, 'e@example.com', 'Проигрыш', 1778630756, -160, '13:39:40', '2025-10-19'),
(246, 'e@example.com', 'Выигрыш', 1778631076, 320, '13:39:47', '2025-10-19'),
(247, 'e@example.com', 'Выигрыш', 1778631396, 320, '13:39:53', '2025-10-19'),
(248, 'e@example.com', 'Проигрыш', 1778631076, -320, '13:39:59', '2025-10-19'),
(249, 'e@example.com', 'Проигрыш', 1778630436, -640, '13:40:06', '2025-10-19'),
(250, 'e@example.com', 'Выигрыш', 1778631716, 1280, '13:40:12', '2025-10-19'),
(251, 'e@example.com', 'Выигрыш', 1778632996, 1280, '13:40:18', '2025-10-19'),
(252, 'e@example.com', 'Выигрыш', 1778634276, 1280, '13:40:23', '2025-10-19'),
(253, 'e@example.com', 'Проигрыш', 1778632996, -1280, '13:40:28', '2025-10-19'),
(254, 'e@example.com', 'Проигрыш', 1778630436, -2560, '13:40:35', '2025-10-19'),
(255, 'e@example.com', 'Проигрыш', 1778625316, -5120, '13:40:42', '2025-10-19'),
(256, 'e@example.com', 'Выигрыш', 1778635556, 10240, '13:40:57', '2025-10-19'),
(257, 'e@example.com', 'Выигрыш', 1778645796, 10240, '13:41:03', '2025-10-19'),
(258, 'e@example.com', 'Выигрыш', 1778656036, 10240, '13:41:08', '2025-10-19'),
(259, 'e@example.com', 'Выигрыш', 1778666276, 10240, '13:41:13', '2025-10-19'),
(260, 'e@example.com', 'Выигрыш', 1778676516, 10240, '13:41:19', '2025-10-19'),
(261, 'e@example.com', 'Проигрыш', 1778666276, -10240, '13:41:25', '2025-10-19'),
(262, 'e@example.com', 'Проигрыш', 1778645796, -20480, '13:41:31', '2025-10-19'),
(263, 'e@example.com', 'Выигрыш', 1778686756, 40960, '13:41:42', '2025-10-19'),
(264, 'e@example.com', 'Выигрыш', 1778727716, 40960, '13:41:58', '2025-10-19'),
(265, 'e@example.com', 'Выигрыш', 1778768676, 40960, '13:42:05', '2025-10-19'),
(266, 'e@example.com', 'Выигрыш', 1778809636, 40960, '13:42:11', '2025-10-19'),
(267, 'e@example.com', 'Выигрыш', 1778850596, 40960, '13:42:18', '2025-10-19'),
(268, 'e@example.com', 'Выигрыш', 1778891556, 40960, '13:42:24', '2025-10-19'),
(269, 'e@example.com', 'Проигрыш', 1778850596, -40960, '13:42:41', '2025-10-19'),
(270, 'e@example.com', 'Выигрыш', 1778932516, 81920, '13:42:48', '2025-10-19'),
(271, 'e@example.com', 'Выигрыш', 1779014436, 81920, '13:42:54', '2025-10-19'),
(272, 'e@example.com', 'Проигрыш', 1778932516, -81920, '13:43:01', '2025-10-19'),
(273, 'e@example.com', 'Выигрыш', 1779096356, 163840, '13:43:07', '2025-10-19'),
(274, 'e@example.com', 'Выигрыш', 1779260196, 163840, '13:43:14', '2025-10-19'),
(275, 'e@example.com', 'Проигрыш', 1779096356, -163840, '13:43:20', '2025-10-19'),
(276, 'e@example.com', 'Выигрыш', 1779424036, 327680, '13:43:26', '2025-10-19'),
(277, 'e@example.com', 'Выигрыш', 1779751716, 327680, '13:43:33', '2025-10-19'),
(278, 'e@example.com', 'Проигрыш', 1779424036, -327680, '13:43:39', '2025-10-19'),
(279, 'e@example.com', 'Проигрыш', 1778768676, -655360, '13:43:46', '2025-10-19'),
(280, 'e@example.com', 'Выигрыш', 1780079396, 1310720, '13:43:52', '2025-10-19'),
(281, 'e@example.com', 'Выигрыш', 1781390116, 1310720, '13:43:58', '2025-10-19'),
(282, 'e@example.com', 'Выигрыш', 1782700836, 1310720, '13:44:03', '2025-10-19'),
(283, 'e@example.com', 'Выигрыш', 1784011556, 1310720, '13:44:08', '2025-10-19'),
(284, 'e@example.com', 'Проигрыш', 1782700836, -1310720, '13:44:19', '2025-10-19'),
(285, 'e@example.com', 'Проигрыш', 1780079396, -2621440, '13:44:38', '2025-10-19'),
(286, 'e@example.com', 'Проигрыш', 1774836516, -5242880, '13:44:44', '2025-10-19'),
(287, 'e@example.com', 'Проигрыш', 1764350756, -10485760, '13:44:50', '2025-10-19'),
(288, 'e@example.com', 'Проигрыш', 1743379236, -20971520, '13:44:56', '2025-10-19'),
(289, 'e@example.com', 'Проигрыш', 1701436196, -41943040, '13:45:02', '2025-10-19'),
(290, 'e@example.com', 'Проигрыш', 1617550116, -83886080, '13:45:09', '2025-10-19'),
(291, 'e@example.com', 'Выигрыш', 1785322276, 167772160, '13:45:16', '2025-10-19'),
(292, 'e@example.com', 'Проигрыш', 1617550116, -167772160, '13:45:22', '2025-10-19'),
(293, 'e@example.com', 'Проигрыш', 1282005796, -335544320, '13:45:38', '2025-10-19'),
(294, 'e@example.com', 'Выигрыш', 1953094436, 671088640, '13:45:44', '2025-10-19'),
(295, 'e@example.com', 'Проигрыш', 1282005796, -671088640, '13:45:50', '2025-10-19'),
(296, 'e@example.com', 'Проигрыш', 0, -1282005796, '13:45:56', '2025-10-19'),
(297, 'e@example.com', 'Проигрыш', 0, 0, '13:46:40', '2025-10-19'),
(298, 'e@example.com', 'Пополнение', 1300, 1300, '13:55:33', '2025-10-19'),
(299, 'e@example.com', 'Покупка', 1100, -200, '13:55:56', '2025-10-19'),
(300, 'e@example.com', 'Проигрыш', 1090, -10, '13:56:07', '2025-10-19'),
(301, 'e@example.com', 'Проигрыш', 1080, -10, '13:56:09', '2025-10-19'),
(302, 'e@example.com', 'Проигрыш', 1070, -10, '13:56:11', '2025-10-19'),
(303, 'e@example.com', 'Проигрыш', 1060, -10, '13:56:13', '2025-10-19'),
(304, 'e@example.com', 'Проигрыш', 1050, -10, '13:56:15', '2025-10-19'),
(305, 'e@example.com', 'Проигрыш', 1040, -10, '13:56:17', '2025-10-19'),
(306, 'e@example.com', 'Проигрыш', 1030, -10, '13:56:19', '2025-10-19'),
(307, 'e@example.com', 'Выигрыш', 1040, 10, '13:56:21', '2025-10-19'),
(308, 'e@example.com', 'Проигрыш', 1030, -10, '13:56:29', '2025-10-19'),
(309, 'e@example.com', 'Выигрыш', 1040, 10, '13:56:33', '2025-10-19'),
(310, 'e@example.com', 'Проигрыш', 1030, -10, '13:56:59', '2025-10-19'),
(311, 'e@example.com', 'Проигрыш', 1020, -10, '13:57:01', '2025-10-19'),
(312, 'e@example.com', 'Проигрыш', 1010, -10, '13:57:05', '2025-10-19'),
(313, 'e@example.com', 'Продажа', 100000499, 500, '01:16:57', '2025-10-20'),
(314, 'e@example.com', 'Проигрыш', 100000489, -10, '01:18:11', '2025-10-20'),
(315, 'e@example.com', 'Проигрыш', 100000479, -10, '01:18:46', '2025-10-20'),
(316, 'e@example.com', 'Проигрыш', 100000469, -10, '01:18:48', '2025-10-20'),
(317, 'e@example.com', 'Проигрыш', 100000459, -10, '01:18:51', '2025-10-20'),
(318, 'e@example.com', 'Проигрыш', 100000449, -10, '01:18:53', '2025-10-20'),
(319, 'e@example.com', 'Проигрыш', 100000439, -10, '01:18:55', '2025-10-20'),
(320, 'e@example.com', 'Выигрыш', 100000459, 20, '01:18:58', '2025-10-20'),
(321, 'e@example.com', 'Проигрыш', 100000449, -10, '01:20:46', '2025-10-20'),
(322, 'e@example.com', 'Проигрыш', 100000439, -10, '01:21:10', '2025-10-20'),
(323, 'e@example.com', 'Проигрыш', 100000429, -10, '01:21:14', '2025-10-20'),
(324, 'e@example.com', 'Выигрыш', 100000439, 10, '01:21:16', '2025-10-20'),
(325, 'e@example.com', 'Выигрыш', 100000464, 25, '01:21:18', '2025-10-20'),
(326, 'e@example.com', 'Выигрыш', 100000474, 10, '01:21:22', '2025-10-20'),
(327, 'e@example.com', 'Проигрыш', 100000464, -10, '01:21:24', '2025-10-20'),
(328, 'e@example.com', 'Проигрыш', 100000454, -10, '01:21:27', '2025-10-20'),
(329, 'e@example.com', 'Проигрыш', 100000444, -10, '01:21:29', '2025-10-20'),
(330, 'e@example.com', 'Выигрыш', 100000469, 25, '01:21:32', '2025-10-20'),
(331, 'e@example.com', 'Проигрыш', 100000459, -10, '01:21:34', '2025-10-20'),
(332, 'e@example.com', 'Выигрыш', 100000469, 10, '01:21:37', '2025-10-20'),
(333, 'e@example.com', 'Выигрыш', 100000479, 10, '01:21:39', '2025-10-20'),
(334, 'e@example.com', 'Проигрыш', 100000469, -10, '01:21:42', '2025-10-20'),
(335, 'e@example.com', 'Выигрыш', 100000479, 10, '01:21:44', '2025-10-20'),
(336, 'e@example.com', 'Проигрыш', 100000469, -10, '01:21:48', '2025-10-20'),
(337, 'e@example.com', 'Проигрыш', 100000459, -10, '01:21:50', '2025-10-20'),
(338, 'e@example.com', 'Проигрыш', 100000449, -10, '01:21:53', '2025-10-20'),
(339, 'e@example.com', 'Выигрыш', 100000489, 40, '01:21:56', '2025-10-20'),
(340, 'e@example.com', 'Проигрыш', 100000479, -10, '01:22:01', '2025-10-20'),
(341, 'e@example.com', 'Проигрыш', 100000469, -10, '01:22:04', '2025-10-20'),
(342, 'e@example.com', 'Выигрыш', 100000479, 10, '01:22:06', '2025-10-20'),
(343, 'e@example.com', 'Проигрыш', 100000469, -10, '01:22:09', '2025-10-20'),
(344, 'e@example.com', 'Проигрыш', 100000459, -10, '01:22:11', '2025-10-20'),
(345, 'e@example.com', 'Выигрыш', 100000469, 10, '01:22:14', '2025-10-20'),
(346, 'e@example.com', 'Проигрыш', 100000459, -10, '01:22:17', '2025-10-20'),
(347, 'e@example.com', 'Проигрыш', 100000449, -10, '01:22:19', '2025-10-20'),
(348, 'e@example.com', 'Выигрыш', 100000469, 20, '01:22:22', '2025-10-20'),
(349, 'e@example.com', 'Выигрыш', 100000479, 10, '01:22:25', '2025-10-20'),
(350, 'e@example.com', 'Проигрыш', 100000469, -10, '01:22:27', '2025-10-20'),
(351, 'e@example.com', 'Проигрыш', 100000459, -10, '01:22:30', '2025-10-20'),
(352, 'e@example.com', 'Проигрыш', 100000449, -10, '01:22:32', '2025-10-20'),
(353, 'e@example.com', 'Проигрыш', 100000439, -10, '01:22:35', '2025-10-20'),
(354, 'e@example.com', 'Проигрыш', 100000429, -10, '01:22:37', '2025-10-20'),
(355, 'e@example.com', 'Выигрыш', 100000439, 10, '01:22:39', '2025-10-20'),
(356, 'e@example.com', 'Проигрыш', 100000429, -10, '01:22:42', '2025-10-20'),
(357, 'e@example.com', 'Выигрыш', 100000439, 10, '01:22:44', '2025-10-20'),
(358, 'e@example.com', 'Выигрыш', 100000449, 10, '01:22:46', '2025-10-20'),
(359, 'e@example.com', 'Проигрыш', 100000439, -10, '01:22:48', '2025-10-20'),
(360, 'e@example.com', 'Выигрыш', 100000459, 20, '01:22:50', '2025-10-20'),
(361, 'e@example.com', 'Проигрыш', 100000449, -10, '01:22:53', '2025-10-20'),
(362, 'e@example.com', 'Выигрыш', 100000464, 15, '01:22:55', '2025-10-20'),
(363, 'e@example.com', 'Проигрыш', 100000454, -10, '01:22:57', '2025-10-20'),
(364, 'e@example.com', 'Выигрыш', 100000504, 50, '01:23:00', '2025-10-20'),
(365, 'e@example.com', 'Проигрыш', 100000494, -10, '01:23:02', '2025-10-20'),
(366, 'e@example.com', 'Проигрыш', 100000484, -10, '01:23:04', '2025-10-20'),
(367, 'e@example.com', 'Проигрыш', 100000474, -10, '01:23:07', '2025-10-20'),
(368, 'e@example.com', 'Проигрыш', 100000464, -10, '01:23:09', '2025-10-20'),
(369, 'e@example.com', 'Проигрыш', 100000454, -10, '01:23:12', '2025-10-20'),
(370, 'e@example.com', 'Выигрыш', 100000479, 25, '01:23:15', '2025-10-20'),
(371, 'e@example.com', 'Проигрыш', 100000469, -10, '01:23:21', '2025-10-20'),
(372, 'e@example.com', 'Проигрыш', 100000459, -10, '01:23:24', '2025-10-20'),
(373, 'e@example.com', 'Выигрыш', 100000469, 10, '01:23:29', '2025-10-20'),
(374, 'e@example.com', 'Проигрыш', 100000459, -10, '01:23:32', '2025-10-20'),
(375, 'e@example.com', 'Проигрыш', 100000449, -10, '01:23:35', '2025-10-20'),
(376, 'e@example.com', 'Проигрыш', 100000439, -10, '01:23:37', '2025-10-20'),
(377, 'e@example.com', 'Проигрыш', 100000429, -10, '01:23:39', '2025-10-20'),
(378, 'e@example.com', 'Проигрыш', 100000419, -10, '01:23:41', '2025-10-20'),
(379, 'e@example.com', 'Выигрыш', 100000434, 15, '01:23:43', '2025-10-20'),
(380, 'e@example.com', 'Проигрыш', 100000424, -10, '01:23:46', '2025-10-20'),
(381, 'e@example.com', 'Проигрыш', 100000414, -10, '01:23:48', '2025-10-20'),
(382, 'e@example.com', 'Проигрыш', 100000404, -10, '01:23:50', '2025-10-20'),
(383, 'e@example.com', 'Проигрыш', 100000394, -10, '01:23:52', '2025-10-20'),
(384, 'e@example.com', 'Проигрыш', 100000384, -10, '01:23:55', '2025-10-20'),
(385, 'e@example.com', 'Проигрыш', 100000374, -10, '01:23:57', '2025-10-20'),
(386, 'e@example.com', 'Проигрыш', 100000364, -10, '01:23:59', '2025-10-20'),
(387, 'e@example.com', 'Выигрыш', 100000374, 10, '01:24:01', '2025-10-20'),
(388, 'e@example.com', 'Проигрыш', 100000364, -10, '01:24:04', '2025-10-20'),
(389, 'e@example.com', 'Проигрыш', 100000354, -10, '01:24:06', '2025-10-20'),
(390, 'e@example.com', 'Выигрыш', 100000364, 10, '01:24:08', '2025-10-20'),
(391, 'e@example.com', 'Проигрыш', 100000354, -10, '01:24:11', '2025-10-20'),
(392, 'e@example.com', 'Выигрыш', 100000364, 10, '01:24:13', '2025-10-20'),
(393, 'e@example.com', 'Проигрыш', 100000354, -10, '01:24:15', '2025-10-20'),
(394, 'e@example.com', 'Выигрыш', 100000374, 20, '01:24:17', '2025-10-20'),
(395, 'e@example.com', 'Проигрыш', 100000364, -10, '01:24:20', '2025-10-20'),
(396, 'e@example.com', 'Проигрыш', 100000354, -10, '01:24:22', '2025-10-20'),
(397, 'e@example.com', 'Выигрыш', 100000379, 25, '01:24:24', '2025-10-20'),
(398, 'e@example.com', 'Выигрыш', 100000389, 10, '01:24:26', '2025-10-20'),
(399, 'e@example.com', 'Проигрыш', 100000379, -10, '01:24:28', '2025-10-20'),
(400, 'e@example.com', 'Проигрыш', 100000369, -10, '01:24:31', '2025-10-20'),
(401, 'e@example.com', 'Проигрыш', 100000359, -10, '01:24:33', '2025-10-20'),
(402, 'e@example.com', 'Проигрыш', 100000349, -10, '01:24:35', '2025-10-20'),
(403, 'e@example.com', 'Проигрыш', 100000339, -10, '01:24:38', '2025-10-20'),
(404, 'e@example.com', 'Выигрыш', 100000359, 20, '01:24:40', '2025-10-20'),
(405, 'e@example.com', 'Проигрыш', 100000349, -10, '01:24:45', '2025-10-20'),
(406, 'e@example.com', 'Проигрыш', 100000339, -10, '01:24:48', '2025-10-20'),
(407, 'e@example.com', 'Выигрыш', 100000379, 40, '01:24:51', '2025-10-20'),
(408, 'e@example.com', 'Проигрыш', 100000369, -10, '01:24:55', '2025-10-20'),
(409, 'e@example.com', 'Проигрыш', 100000359, -10, '01:24:57', '2025-10-20'),
(410, 'e@example.com', 'Выигрыш', 100000369, 10, '01:24:59', '2025-10-20'),
(411, 'e@example.com', 'Выигрыш', 100000379, 10, '01:25:01', '2025-10-20'),
(412, 'e@example.com', 'Проигрыш', 100000369, -10, '01:25:03', '2025-10-20'),
(413, 'e@example.com', 'Выигрыш', 100000379, 10, '01:25:06', '2025-10-20'),
(414, 'e@example.com', 'Проигрыш', 100000369, -10, '01:25:08', '2025-10-20'),
(415, 'e@example.com', 'Проигрыш', 100000359, -10, '01:25:10', '2025-10-20'),
(416, 'e@example.com', 'Проигрыш', 100000349, -10, '01:25:13', '2025-10-20'),
(417, 'e@example.com', 'Выигрыш', 100000359, 10, '01:25:15', '2025-10-20'),
(418, 'e@example.com', 'Проигрыш', 100000349, -10, '01:25:17', '2025-10-20'),
(419, 'e@example.com', 'Выигрыш', 100000359, 10, '01:25:20', '2025-10-20'),
(420, 'e@example.com', 'Проигрыш', 100000349, -10, '01:25:22', '2025-10-20'),
(421, 'e@example.com', 'Проигрыш', 100000339, -10, '01:25:24', '2025-10-20'),
(422, 'e@example.com', 'Проигрыш', 100000329, -10, '01:25:26', '2025-10-20'),
(423, 'e@example.com', 'Проигрыш', 100000319, -10, '01:25:29', '2025-10-20'),
(424, 'e@example.com', 'Проигрыш', 100000309, -10, '01:25:41', '2025-10-20'),
(425, 'e@example.com', 'Проигрыш', 100000299, -10, '01:25:43', '2025-10-20'),
(426, 'e@example.com', 'Проигрыш', 100000289, -10, '01:25:46', '2025-10-20'),
(427, 'e@example.com', 'Выигрыш', 100000299, 10, '01:25:48', '2025-10-20'),
(428, 'e@example.com', 'Проигрыш', 100000289, -10, '01:25:51', '2025-10-20'),
(429, 'e@example.com', 'Проигрыш', 100000279, -10, '01:26:01', '2025-10-20'),
(430, 'e@example.com', 'Выигрыш', 100000319, 40, '01:26:08', '2025-10-20'),
(431, 'e@example.com', 'Проигрыш', 100000309, -10, '01:26:10', '2025-10-20'),
(432, 'e@example.com', 'Выигрыш', 100000319, 10, '01:26:12', '2025-10-20'),
(433, 'e@example.com', 'Проигрыш', 100000309, -10, '01:26:15', '2025-10-20'),
(434, 'e@example.com', 'Выигрыш', 100000319, 10, '01:26:17', '2025-10-20'),
(435, 'e@example.com', 'Выигрыш', 100000334, 15, '01:26:19', '2025-10-20'),
(436, 'e@example.com', 'Проигрыш', 100000324, -10, '01:26:22', '2025-10-20'),
(437, 'e@example.com', 'Выигрыш', 100000374, 50, '01:26:24', '2025-10-20'),
(438, 'e@example.com', 'Проигрыш', 100000364, -10, '01:26:28', '2025-10-20'),
(439, 'e@example.com', 'Проигрыш', 100000354, -10, '01:26:31', '2025-10-20'),
(440, 'e@example.com', 'Выигрыш', 100000364, 10, '01:26:33', '2025-10-20'),
(441, 'e@example.com', 'Проигрыш', 100000354, -10, '01:26:36', '2025-10-20'),
(442, 'e@example.com', 'Выигрыш', 100000364, 10, '01:26:38', '2025-10-20'),
(443, 'e@example.com', 'Проигрыш', 100000354, -10, '01:26:41', '2025-10-20'),
(444, 'e@example.com', 'Проигрыш', 100000344, -10, '01:26:43', '2025-10-20'),
(445, 'e@example.com', 'Проигрыш', 100000334, -10, '01:26:45', '2025-10-20'),
(446, 'e@example.com', 'Выигрыш', 100000344, 10, '01:26:47', '2025-10-20'),
(447, 'e@example.com', 'Проигрыш', 100000334, -10, '01:26:49', '2025-10-20'),
(448, 'e@example.com', 'Проигрыш', 100000324, -10, '01:26:54', '2025-10-20'),
(449, 'e@example.com', 'Проигрыш', 100000314, -10, '01:26:56', '2025-10-20'),
(450, 'e@example.com', 'Проигрыш', 100000304, -10, '01:26:58', '2025-10-20');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cards`
--
ALTER TABLE `cards`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email` (`email`);

--
-- Индексы таблицы `inventory`
--
ALTER TABLE `inventory`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email` (`email`),
  ADD KEY `item_id` (`item_id`);

--
-- Индексы таблицы `items`
--
ALTER TABLE `items`
  ADD PRIMARY KEY (`item_id`),
  ADD KEY `item_type` (`item_type`);

--
-- Индексы таблицы `item_type`
--
ALTER TABLE `item_type`
  ADD PRIMARY KEY (`item_type`);

--
-- Индексы таблицы `op_types`
--
ALTER TABLE `op_types`
  ADD PRIMARY KEY (`op_type`),
  ADD UNIQUE KEY `op_type` (`op_type`);

--
-- Индексы таблицы `statuses`
--
ALTER TABLE `statuses`
  ADD PRIMARY KEY (`status_name`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`email`),
  ADD KEY `status` (`status`);

--
-- Индексы таблицы `user_game_story`
--
ALTER TABLE `user_game_story`
  ADD UNIQUE KEY `op_id` (`op_id`,`email`),
  ADD KEY `op_type` (`op_type`),
  ADD KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cards`
--
ALTER TABLE `cards`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `inventory`
--
ALTER TABLE `inventory`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'идентификатор предмета 1 предмет одному игроку', AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT для таблицы `items`
--
ALTER TABLE `items`
  MODIFY `item_id` int NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор предмета', AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT для таблицы `user_game_story`
--
ALTER TABLE `user_game_story`
  MODIFY `op_id` int NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор операции', AUTO_INCREMENT=451;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `cards`
--
ALTER TABLE `cards`
  ADD CONSTRAINT `cards_ibfk_1` FOREIGN KEY (`email`) REFERENCES `users` (`email`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `inventory`
--
ALTER TABLE `inventory`
  ADD CONSTRAINT `inventory_ibfk_1` FOREIGN KEY (`email`) REFERENCES `users` (`email`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `inventory_ibfk_2` FOREIGN KEY (`item_id`) REFERENCES `items` (`item_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `items`
--
ALTER TABLE `items`
  ADD CONSTRAINT `items_ibfk_1` FOREIGN KEY (`item_type`) REFERENCES `item_type` (`item_type`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_ibfk_1` FOREIGN KEY (`status`) REFERENCES `statuses` (`status_name`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `user_game_story`
--
ALTER TABLE `user_game_story`
  ADD CONSTRAINT `user_game_story_ibfk_1` FOREIGN KEY (`op_type`) REFERENCES `op_types` (`op_type`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_game_story_ibfk_2` FOREIGN KEY (`email`) REFERENCES `users` (`email`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
